app/views/users/_form.html.erb

SELECT "roles".* FROM "roles"
---
<%= form_with(model: @user) do |form| %>
  <%= form.collection_check_boxes :role_ids, Role.all, :id, :name, class:"form-check-input", id:"inlineCheckbox1"%>