app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
      def index
        authorize User
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def edit
         authorize User
          @user = User.find(params[:id])