app/models/user.rb

  def assign_default_role
    self.add_role(:student) if self.roles.blank?
---
SELECT 1 AS one FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]